#include<iostream>
using namespace std;
/// @brief این تابع به روش لاگرانژ به ازای یک دسته زوج مرتب یک چندجمله ای بر روی آن دسته زوج مرتب میپوشاند
/// @param t متغییر مستقل تابع است
/// @param x آرایه ای از مقادیر دانسته از متغیر مستقل
/// @param y آرایه جوابهای دانسته از تابع مجهولی که باید درونیابی شود و هر مقدار آن معادل یکی از مقادیر آرایه اکس است
/// @param size حداکثر اندازه دو آرایه اکس و  وای را تعیین میکند. 
/// @return خروجی مقدار تابع درونیاب است به ازای مقدار متغیر مستقل داده شده به تابع درونیاب
double pn(double t, double x[], double y[], int size)
{
    double result=0;
    for(int i=0;i<size;i++)
    {
        double l=1;
        for(int j=0;j<size;j++)
        {
            // if(j==i) continue;//اینجوری هم میشه
            if(j!=i) 
                l=l*(t-x[j])/(x[i]-x[j]);
        }
        result=result+l*y[i];
    }
    return result;
}
int main()
{
double x[5]={10,25,/*40,*/55,70,85};
double y[5]={342.02,766.04,/*984.8,*/939.7,642.78,173.64};
/// درونیابی برای مقدار ۴۰ که در میان اعداد وارد شده وجود ندارد انجام شده و مقدار آن چاپ میشود.
/// نتیجه نشان داد که این ۹۸۴.۴۵ مقدار خطایی بسیار کمتر از ۱ درصد داشته است.
cout<<"for 40 pn(x)= "<<pn(40,x,y,5)<<endl;
}